rikkapro0128/system_node_esp32_iot/src/main.cpp
#define PIN_RESET_DEFLAUT GPIO_NUM_13

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* MACRO - NODE TYPE - LOGIC *********************************************************************************************************************************************************************************************************************************
 */

#ifdef LOGIC

#define MAX_NAME_INDEX_FIREBASE 25
#define TIMER_INTERVAL_MS 1000
#define ERROR_TIMER 10
#define PIN_OUT 3
#define NUMS_TIMER 30

#endif

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* MACRO - NODE TYPE - COLOR *********************************************************************************************************************************************************************************************************************************
 */

#ifdef COLOR

// define here...

typedef enum MODE_RGB
{
  SINGLE = 0,
  AUTO = 1,
};

typedef enum INDEX_COLOR
{
  COLOR_R = 0,
  COLOR_G = 1,
  COLOR_B = 2,
  COLOR_ALPHA = 3,
};

#define DI GPIO_NUM_27
#define NUMS_LED 16

#define TIME_RESET_DEFAULT 5000
#define POOLING_CHECK_CONNECT_AP 5000
#define POOLING_RESTART_CONNECT_AP 700

#define STATUS_START_DELAY_FLICKER_SHORT 100
#define STATUS_START_DELAY_FLICKER_LONG 1000

#define STATUS_PIN_START GPIO_NUM_16
#define STATUS_PIN_WIFI GPIO_NUM_17

#endif

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* MODE DEV & DEPLOY *********************************************************************************************************************************************************************************************************************************
 */

#define _DEBUG_
#define _RELEASE_

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* VARIABLE GLOBAL *********************************************************************************************************************************************************************************************************************************
 */

// => STATIC
static const char *ntpServer = "pool.ntp.org";
static const char *CHost = "plant.io";

// => RAM INSIDE
String getMac = WiFi.macAddress();
String GEN_ID_BY_MAC = String(getMac);
String ID_DEVICE;
String DATABASE_URL = "";
unsigned long timeStartResetPinDetach;
unsigned long epochTime;
unsigned long wifiStatus;
unsigned long poolingReconnectWifi;
unsigned long blinkStart;
unsigned long timeIntervalCheckRamSize;
uint8_t countBlink = 0;
bool restartConfigWifi = false;
bool lostConnection = false;
bool blockBtnReset = false;
bool disableBtnReset = false;
bool globalRestart = false;
size_t timeoutWifi = 0;

// => RAM NODE TYPE LOGIC
#ifdef LOGIC

static const char *TYPE_DEVICE = "LOGIC";
bool timeControll = false;
bool blockControl = false;
bool control = true;
bool isFirst = true;
size_t timeDebounceLocalControl = 0;
size_t idControl = 0;
int uartPicControl = 0;
unsigned long sendDataPrevMillis = 0;
unsigned long timerStack[NUMS_TIMER][3];
bool stateDevice[3] = {false, false, false};
bool stateDeviceFirebase[3] = {false, false, false};
char indexTimerStack[NUMS_TIMER][MAX_NAME_INDEX_FIREBASE];

// => Firebase data
FirebaseJson timerParseArray;
FirebaseJsonData timerJson;
FirebaseJsonData deviceJson;

#endif

#ifdef COLOR
// define here...
static const char *TYPE_DEVICE = "COLOR";

uint8_t colorPresentState[4] = {0, 0, 0, 0}; // => rgb(0 -> 255, 0 -> 255, 0 -> 255, 0 -> 100)
uint8_t colorFultureState[4] = {0, 0, 0, 0}; // => rgb(0 -> 255, 0 -> 255, 0 -> 255, 0 -> 100)
uint8_t modeRGB = (uint8_t)SINGLE;
bool acceptChange = false;
bool clearEffect = false;
bool requestRestart = false;
unsigned long rgbModeAuto;
uint16_t autoIndexI = 0, autoIndexJ = 0;

// => Firebase data
FirebaseJsonData deviceJson;

#endif

// => Firebase data general
FirebaseJson jsonNewDevice;

// => JSON DOCUMENT
DynamicJsonDocument bufferBodyPaserModeAP(400);

/**
 * ********* CONTRUCTOR NODE TYPE - COLOR *********************************************************************************************************************************************************************************************************************************
 */

#ifdef COLOR
Adafruit_NeoPixel strip = Adafruit_NeoPixel(NUMS_LED, DI, NEO_GRB + NEO_KHZ800);
#endif

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* PROTOTYPE GENERAL *********************************************************************************************************************************************************************************************************************************
 */

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

// => DEBUG FUNC

#ifdef _DEBUG_
void viewEEPROM();
#endif

// => FUNC WEBSEVER SERVER
void checkLinkAppication(AsyncWebServerRequest *request);
void linkAppication(AsyncWebServerRequest *request, JsonVariant &json);
void addConfiguration(AsyncWebServerRequest *request, JsonVariant &json);
void resetConfigurationWifi(AsyncWebServerRequest *request);
void resetConfigurationFirebase(AsyncWebServerRequest *request);
void checkConfiguration(AsyncWebServerRequest *request);
void notFound(AsyncWebServerRequest *request);
void restartEsp(AsyncWebServerRequest *request);

// => FUNC EXECUTE GENERAL

void initResetDeflaut();
void checkRam();
uint32_t ramHeapSize();
void setupStreamFirebase();
void checkFirebaseInit();
void setupWifiModeStation();
void setupWebserverModeAP();
void clearBufferFirebaseDataAll();
unsigned long Get_Epoch_Time();
void streamCallback(FirebaseStream data);
void streamTimeoutCallback(bool timeout);
unsigned int strLength(const char *str);

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* PROTOTYPE NODE TYPE -> LOGIC *********************************************************************************************************************************************************************************************************************************
 */

#ifdef LOGIC
#ifdef _DEBUG_
void PrintListTimer();
#endif
void parserTimerJson(FirebaseStream &data, uint8_t numberDevice, bool isInit = true);
void parserDeviceStatus(FirebaseStream &data, uint8_t numberDevice);
void controllDevice(uint8_t numDevice, bool state, bool syncFirebase = false, bool ignore = false);
void readTimer(FirebaseJson &fbJson, uint8_t numberDevice, String keyAdd = "");
void removeTimer(unsigned long stack[][3], char stackName[][MAX_NAME_INDEX_FIREBASE], String key, bool isCallBack = false);
void sortTimer(unsigned long stack[][3], char stackName[][MAX_NAME_INDEX_FIREBASE]);
#endif

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* PROTOTYPE NODE TYPE -> COLOR *********************************************************************************************************************************************************************************************************************************
 */

// define here....
#ifdef COLOR

void initSignal();
bool fadeColor(INDEX_COLOR index);
void setColorChainRGBA(uint32_t c, uint8_t a);
void parserColorRGB(FirebaseStream &data, String prefix = "");
uint8_t parserColorStyle(FirebaseStream &data, bool init = false);
uint32_t Wheel(byte WheelPos);
void clearEffectColor(uint8_t brightness = 100);

#endif

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 * ********* EEPROM *********************************************************************************************************************************************************************************************************************************
 */
EepromMiru eeprom(350, "esp8266-device-db-default-rtdb.firebaseio.com");

/**
 * ********* SERVER *********************************************************************************************************************************************************************************************************************************
 */
AsyncWebServer server(80);

/**
 * ********* FIREBASE *******************************************************************************************************************************************************************************************************************************
 */
FirebaseData fbdoStream;
FirebaseData fbdoControl;
FirebaseData createNode;
FirebaseData removeNode;

FirebaseAuth auth;
FirebaseConfig config;

/**
 * ********* WIFI MODE - STATION ********************************************************************************************************************************************************************************************************************
 */

String mode_ap_ssid = "esp32-";
String mode_ap_pass = "44448888";

void setup()
{
  initResetDeflaut();
#ifdef COLOR
  initSignal();
#endif

