rikkapro0128/system_node_esp32_iot/src/main.cpp
  GEN_ID_BY_MAC.replace(":", "");
  ID_DEVICE = String("device-" + GEN_ID_BY_MAC);

#ifdef _DEBUG_
  Serial.begin(115200);
#endif
#ifdef _RELEASE_
  Serial.begin(115200);
#endif

#ifdef COLOR
  strip.begin();
  strip.setBrightness(100);
  strip.show();
#endif

#ifdef _DEBUG_
  Serial.println("");
  Serial.println("[---PROGRAM START---]");
#endif

  configTime(0, 0, ntpServer);
  eeprom.begin();

#ifdef _DEBUG_
  viewEEPROM();
#endif

  WiFi.hostname(CHost);
  WiFi.mode(WIFI_AP_STA);
  WiFi.persistent(true);
  WiFi.softAP(String(mode_ap_ssid + GEN_ID_BY_MAC).c_str(), mode_ap_pass.c_str());

#ifdef _DEBUG_
  IPAddress IP = WiFi.softAPIP();
  Serial.print("AP IP address: ");
#endif

  setupWifiModeStation();

  while (WiFi.status() != WL_CONNECTED)
  {
    if (timeoutWifi > 12)
    {
      WiFi.disconnect(true);
      break;
    }
    timeoutWifi++;
    delay(500);
  }

#ifdef COLOR
  if (WiFi.status() == WL_CONNECTED)
  {
    digitalWrite(STATUS_PIN_WIFI, HIGH);
  }
  else
  {
    digitalWrite(STATUS_PIN_WIFI, LOW);
  }
#endif

  setupWebserverModeAP();

  config.database_url = eeprom.databaseUrl;
  config.signer.test_mode = true;
#ifdef ESP8266
  fbdoStream.setBSSLBufferSize(1024 /* Rx in bytes, 512 - 16384 */, 1024 /* Tx in bytes, 512 - 16384 */);
#endif

  Firebase.begin(&config, &auth);
  Firebase.reconnectWiFi(true);
  checkFirebaseInit();
}

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

void loop()
{

  if (globalRestart)
  {
    ESP.restart();
  }

  if (restartConfigWifi) // restart & init new connection to access point
  {
    if (millis() - poolingReconnectWifi > POOLING_RESTART_CONNECT_AP)
    {
      poolingReconnectWifi = millis();
      if (WiFi.status() == WL_CONNECTED)
      {
        restartConfigWifi = false;
#ifdef COLOR
        clearEffect = true;
        digitalWrite(STATUS_PIN_WIFI, HIGH);
#endif
        clearBufferFirebaseDataAll();
        checkFirebaseInit();
      }
      else
      {
        lostConnection = true;
        WiFi.reconnect();
      }
    }
  }

  if (millis() - wifiStatus > POOLING_CHECK_CONNECT_AP && !restartConfigWifi) // check status connect, reconnect if this conection failure!
  {
    wifiStatus = millis();
    if (WiFi.status() == WL_CONNECTED)
    {
#ifdef COLOR
      if (lostConnection)
      {
        clearEffect = true;
        lostConnection = false;
      }
      digitalWrite(STATUS_PIN_WIFI, HIGH);
#endif
    }
    else
    {
      lostConnection = true;
      WiFi.reconnect();
      fbdoStream.tcpClient.networkReconnect();
#ifdef COLOR
      digitalWrite(STATUS_PIN_WIFI, LOW);
#endif
    }
  }

  if (millis() - blinkStart > STATUS_START_DELAY_FLICKER_SHORT) // this is animation status run mode
  {
    if (countBlink < 4)
    {
      blinkStart = millis();
      if (countBlink % 2 == 0)
      {
        digitalWrite(STATUS_PIN_START, HIGH);
      }
      else
      {
        digitalWrite(STATUS_PIN_START, LOW);
      }
      countBlink++;
    }
    else if (millis() - blinkStart > STATUS_START_DELAY_FLICKER_LONG)
    {
      blinkStart = millis();
      countBlink = 0;
    }
  }

  if (!disableBtnReset)
  {

    if (digitalRead(PIN_RESET_DEFLAUT) == LOW && !blockBtnReset)
    {
      timeStartResetPinDetach = millis();
      blockBtnReset = true;
#ifdef _DEBUG_
      Serial.println("[DEBUG] Start btn HIGH");
#endif
    }

    if (digitalRead(PIN_RESET_DEFLAUT) == HIGH && blockBtnReset)
    {
#ifdef _DEBUG_
      Serial.println("[DEBUG] Start btn LOW");
#endif
      blockBtnReset = false;
    }

    if (millis() - timeStartResetPinDetach > TIME_RESET_DEFAULT && blockBtnReset)
    {
#ifdef _DEBUG_
      Serial.println("[DEBUG] Start Reset Default");
#endif

      if (eeprom.DATABASE_NODE.length() > 0)
      {
        Firebase.RTDB.endStream(&fbdoStream);
        clearBufferFirebaseDataAll();
        if (ramHeapSize() > SSL_HANDSHAKE_REQUIRE * 1000)
        {
#ifdef _DEBUG_
          Serial.println("[DEBUG] Remove Database node: " + eeprom.DATABASE_NODE);
#endif
          if (Firebase.RTDB.deleteNode(&removeNode, eeprom.DATABASE_NODE))
          {
#ifdef _DEBUG_
            Serial.println("[DEBUG] Remove Database node successfull!");
#endif
          }
          else
          {
#ifdef _DEBUG_
            Serial.println("[DEBUG] Remove Database node failure!");
#endif
          }
        }
        else
        {

#ifdef _DEBUG_
          Serial.println("[DEBUG] Heap ram not enough to handshake ssl delete node!");
#endif
        }
        // reset link application
        eeprom.saveNodeID("");
        eeprom.saveUserID("");

        // reset wifi configration
        eeprom.savePassword("");
        eeprom.saveSSID("");
      }
      else
      {
#ifdef _DEBUG_
        Serial.println("[DEBUG] Not found node url to remove!");
#endif
      }

#ifdef LOGIC
      globalRestart = true;
#endif

#ifdef COLOR
      eeprom.saveStyleColor(SINGLE);
      requestRestart = true;
      clearEffect = true;
#endif
      disableBtnReset = true;
      blockBtnReset = false;
    }
  }

#ifdef LOGIC
#ifdef _RELEASE_
  if (Serial.available() > 0)
  {
    uartPicControl = (int)Serial.parseInt();
    if (uartPicControl > 0 && blockControl == false)
    {
      control = uartPicControl % 2 == 0 ? false : true;
      if (uartPicControl < 3)
      {
        idControl = 1;
      }
      else if (uartPicControl < 5)
      {
        idControl = 2;
      }
      else if (uartPicControl < 7)
      {
        idControl = 3;
      }
      if (millis() - timeDebounceLocalControl > 1000)
      {
        timeDebounceLocalControl = millis();
        if (WiFi.status() == WL_CONNECTED)
        {
          controllDevice(idControl, control, true, true);
        }
        else
        {
          controllDevice(idControl, control, false, true);
        }
      }
    }
  }
#endif
  if ((millis() - sendDataPrevMillis > 2500 || sendDataPrevMillis == 0))
  {
    sendDataPrevMillis = millis();
    if (timerStack[0][1] != NULL && timeControll)
    {
#ifdef _DEBUG_
      PrintListTimer();
#endif
      epochTime = Get_Epoch_Time();
#ifdef _DEBUG_
      Serial.println("TimeStamp = " + String(epochTime));
#endif
      bool expire = timerStack[0][1] > epochTime && timerStack[0][1] != NULL ? false : true;
      if (expire)
      {
        unsigned long rangeTimer = epochTime - timerStack[0][1];
        if (rangeTimer < 4)
        {
#ifdef _RELEASE_
          bool state = timerStack[0][2] == 1 ? true : timerStack[0][2] == 2           ? false
                                                  : stateDevice[timerStack[0][0] - 1] ? false
                                                                                      : true;
          controllDevice(timerStack[0][0], state, true);
#endif
        }
#ifdef _DEBUG_
        Serial.printf("Controll timer = %d\n", timerStack[0][1]);
        Serial.printf("[Epoch Time] = %d", rangeTimer);
#endif
        removeTimer(timerStack, indexTimerStack, indexTimerStack[0]);
      }
    }
  }
#endif

#ifdef COLOR
  // execute something...
  if (clearEffect)
  {
    clearEffectColor();
    clearEffect = false;
  }
  if (modeRGB == SINGLE && !clearEffect)
  {
    if (acceptChange)
    {
      while (true)
      {
        bool resultR = fadeColor(COLOR_R);
        bool resultG = fadeColor(COLOR_G);
        bool resultB = fadeColor(COLOR_B);
        bool resultALPHA = fadeColor(COLOR_ALPHA);
        setColorChainRGBA(strip.Color(colorPresentState[0], colorPresentState[1], colorPresentState[2]), colorPresentState[3]);
        if (!resultR && !resultG && !resultB && !resultALPHA)
        {
          break;
        }
      }
      acceptChange = false;
    }
  }
  else if (modeRGB == AUTO && !clearEffect)
  {
    strip.setPixelColor(autoIndexI, Wheel(((autoIndexI * 256 / strip.numPixels()) + autoIndexJ) & 255));
    autoIndexI++;
    if (autoIndexI >= strip.numPixels() && millis() - rgbModeAuto > 20)
    {
      rgbModeAuto = millis();
      autoIndexI = 0;
      autoIndexJ++;
      strip.show();
    }
    if (autoIndexJ >= (256 * 5) - 1)
    {
      autoIndexJ = 0;
    }
  }

#endif

#ifdef _DEBUG_
  if (millis() - timeIntervalCheckRamSize > 2500)
  {
    timeIntervalCheckRamSize = millis();
    checkRam();
  }
#endif
}

/* ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ */

/**
 *   [********* START DEFINE FUNCTION REQUEST *********]
 *
 */

